[{"id":"bc61cb39-70de-49ff-b086-6916c12caafc","type":"Full Time","url":"https://jobs.github.com/positions/bc61cb39-70de-49ff-b086-6916c12caafc","created_at":"Thu Nov 21 15:25:17 UTC 2019","company":"Synaptikon GmbH","company_url":null,"location":"Berlin","title":"Senior Web Developer - PHP / MySQL","description":"\u003cp\u003eWe at NeuroNation use technology to stimulate the brain’s ability to form new connections to achieve better health and cognitive recovery for our users. We do it with a community of scientists, clinicians and more than 16 million people all over the world.\u003c/p\u003e\n\u003cp\u003eWith Gamification in our DNA, we help people stay motivated while training their memory, concentration, and intelligence. As a result, NeuroNation has received awards from major health insurance companies such as the AOK, funded by the German Federal Ministry of Health.\u003c/p\u003e\n\u003cp\u003eWe start new projects and open new roles for mid and senior-level developers, who can help us help millions of people to stay fit or regain their cognitive skills. If you are interested in solid microservices, REST APIs and enjoy building useful web apps, let’s talk.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat can you do?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContribute to our microservice architecture with your ideas and best practices in software development.\u003c/li\u003e\n\u003cli\u003eTake ownership of our code and ensure its efficiency and stability.\u003c/li\u003e\n\u003cli\u003eWork with solid backend solutions.\u003c/li\u003e\n\u003cli\u003eWork together with a professional cross-functional team.\u003c/li\u003e\n\u003cli\u003eHave direct impact on the success of our products.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat should you bring?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAdvanced knowledge of PHP5/7.\u003c/li\u003e\n\u003cli\u003eHigh proficiency on advanced SQL for big tables, high performance and availability.\u003c/li\u003e\n\u003cli\u003eSolid experience working with OOP, REST APIs, Automated Testing, related concepts and frameworks\u003c/li\u003e\n\u003cli\u003eHabit of writing clear, understandable and well-documented code\u003c/li\u003e\n\u003cli\u003eCuriosity and openness to learn and solve problems using new technologies\u003c/li\u003e\n\u003cli\u003eWork permit for Germany / EU\u003c/li\u003e\n\u003cli\u003eAs a plus, you also have some experience with any of the following: Slim, Lavarel, Lumen, Stripe, PayPal, Heroku, AWS, Vagrant, Docker, SilverStripe,\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate technology of real value to people\u003c/li\u003e\n\u003cli\u003eCreate exciting and useful technology, instead of spending your life with boring corporate, agency and advertising jobs\u003c/li\u003e\n\u003cli\u003eRevolutionize the health system\u003c/li\u003e\n\u003cli\u003eCompetitive remuneration\u003c/li\u003e\n\u003cli\u003eAgile working environment and cross-functional team\u003c/li\u003e\n\u003cli\u003eFlexible working hours and home office options\nCoaching, learning and education budgets to move your career forward\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo apply, please send your latest CV, cover letter, possible starting date and salary expectations via email to \u003ca href=\"mailto:jobs@neuronation.de\"\u003ejobs@neuronation.de\u003c/a\u003e with the subject “Web Developer Application”.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eTo apply, please send your latest CV, cover letter, possible starting date and salary expectations via email to \u003ca href=\"mailto:jobs@neuronation.de\"\u003ejobs@neuronation.de\u003c/a\u003e with the subject “Web Developer Application”.\u003c/p\u003e\n","company_logo":null},{"id":"82f5b8b2-1c87-40d7-9d06-5c7897887b8e","type":"Full Time","url":"https://jobs.github.com/positions/82f5b8b2-1c87-40d7-9d06-5c7897887b8e","created_at":"Wed Nov 13 16:01:13 UTC 2019","company":"moovel Group GmbH (REACH NOW)","company_url":"https://www.moovel.com/de/DE","location":"Berlin","title":"Backend Engineer (f/m/d) for Mobility Service Provider Squad","description":"\u003ch2\u003e\u003cem\u003eHi,\u003c/em\u003e\u003c/h2\u003e\n\u003cp\u003eWe are Anton, Ben, Bernd, Delia, Mark, Ulf, Patrick and Philip from the Mobility Service Provider (MSP) Squad. As an interdisciplinary team we focus on integrating mobility service providers for car-sharing, scooters, bike-sharing and ride-hailing such as car2go, TIER or FREE NOW (formerly mytaxi) into our urban mobility platform. We care greatly about quality, scalability, ease of use and a great user experience. We’re looking for a backend-focused engineer to join our squad.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eFirst a quick look at us\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eThe subject of mobility is evolving at a startling pace. Fundamentals are being questioned, new ways of getting around are emerging and challenging the established ones. At moovel (becomes REACH NOW), we aim to take part in shaping that future. Software is eating the world and mobility is certainly no exception. Ultimately, we want to help cities become smarter by building on the operational wisdom of city administrations and mobility service providers. We don't want to disrupt, but augment the means of getting around by employing contemporary technology.\u003c/p\u003e\n\u003cp\u003eThe problems we are engaging are manifold and from the real world. Our solutions do not only have an impact on a single industry branch, but also aim to transform the city. They involve fields like routing, searching, AI, innovative UX and much more. Things are very dynamic in the mobility space and thus we devote ourselves to a lot of exploratory work.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eHow the role works\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eWe are building services that provide a fully fledged feature set of urban mobility service providers. Our backend enables the moovel mobility app to find nearby mobility options like car or bike-sharing as well as scooters and ride-hailing services. It also allows booking functionality and handles payment.\u003c/p\u003e\n\u003cp\u003eOur services interact with moovel’s mobility platform as well as external APIs. Many of our services are also exposed to external partners, so they have to be well documented, stable and easy to use. Implementing new services in a consistent way is also very important to us.\u003c/p\u003e\n\u003ch2\u003e\u003cem\u003eSome of the things you will do\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eWork in the Mobility Service Provider (MSP) Squad together with other backend engineers, mobile engineers, QA engineers and designers\u003c/li\u003e\n\u003cli\u003eBuild microservices with Node.js written in TypeScript and deployed on AWSdesign and implement APIs for discovering mobility points, booking flows and payment for mobility services\u003c/li\u003e\n\u003cli\u003eDesign and implement APIs for discovering mobility points, booking flows and payment for mobility services.\u003c/li\u003e\n\u003cli\u003eIntegrate APIs from third-party mobility service providers into our platform.\u003c/li\u003e\n\u003cli\u003eAs we follow agile principles, you will participate in defining our products and building them. Your input is valued!\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cem\u003eAbout you\u003c/em\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou are an experienced backend-focussed software engineer and like building services using well-defined APIs\u003c/li\u003e\n\u003cli\u003eYou know about Node.js (ideally TypeScript) or are willing to learn it. We believe in hiring great engineers, not programming language experts.\u003c/li\u003e\n\u003cli\u003eYou know how to operate services in production: deploying, performance monitoring, tracing problems, and optimization are part of the things you have done in the past\u003c/li\u003e\n\u003cli\u003eWe run our services on Amazon Web Services (AWS) and monitor them with New Relic and Kibana. Knowledge with those technologies is a plus, but not mandatory.\u003c/li\u003e\n\u003cli\u003eYou are able to communicate verbally and written in English (we communicate mostly in English).\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eChoose your own hardware\u003c/li\u003e\n\u003cli\u003eWorking with newest technologies \u0026amp; microservices\u003c/li\u003e\n\u003cli\u003eBe part of an interdisciplinary team of experts\u003c/li\u003e\n\u003cli\u003eWorking on products with a high impact on society\u003c/li\u003e\n\u003cli\u003eInternational teams\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eFree breakfast, good coffee \u0026amp; fresh fruits\u003c/li\u003e\n\u003cli\u003eMonthly mobility budget\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf this caught your attention, then we can not wait to meet you soon! Just click \u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_f_m_d_for_mobility_service_provider_squad_berlin/258565/V819/anwenden\"\u003ethis link\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eYours,\u003c/p\u003e\n\u003cp\u003eAnton, Ben, Bernd, Delia, Mark, Ulf, Patrick and Philip\u003c/p\u003e\n\u003cp\u003eIf you have any questions or are in need for further information feel free to contact Mrs. Nicole Armatowski +49 176 3095 3172\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://moovelgroup.redirect.your-jobresponse.com/backend_engineer_f_m_d_for_mobility_service_provider_squad_berlin/258565/V819/anwenden\"\u003eClick here to apply!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUozIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b5e371ebb7b4a27097825a849cc6a7ae17f1794d/companyLogo-moovelbecomes-withmoovellogo_CMYK_v_Blue.png"},{"id":"9c9146b3-3ac8-42d7-a1f6-870a5adaf078","type":"Full Time","url":"https://jobs.github.com/positions/9c9146b3-3ac8-42d7-a1f6-870a5adaf078","created_at":"Wed Nov 13 12:19:04 UTC 2019","company":"Elinvar GmbH","company_url":"http://http","location":"Berlin","title":"Senior DevOps Engineer (m/f/div)","description":"\u003cp\u003e\u003cstrong\u003eSenior DevOps Engineer (m/f/div)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eElinvar enables Asset \u0026amp; Wealth Managers to digitalize their business model. By combining cutting-edge technology and the regulatory expertise of a licensed financial portfolio manager we offer our partners a comprehensive range of services. The platform's flexibility enables the customized solution for each partner.\u003c/p\u003e\n\u003cp\u003eWorking at Elinvar is like our platform: straightforward and focused on excellence.\nAs a B2B2C provider, we work with portfolio managers who manage billions of Euros in assets under management and have accordingly high expectations of us. Our team of dedicated technology and financial experts work hard to jointly meet and exceed those expectations.\u003c/p\u003e\n\u003cp\u003eAbout the technical stack: the platform consists of dozens of microservices which are mainly based on Java 8. They communicate through Kafka and a GraphQL. Data is stored in PostgreSQL and Couchbase. The services are running in Docker containers on three AWS data centers in a high availability mode, managed by Kubernetes. The frontend is based on React.js. We are using GitLab for source control and continuous integration. The development process is based on Scrum with 2-week sprints.\u003c/p\u003e\n\u003cp\u003eSounds interesting? We're now looking for a Senior DevOps Engineer (m/f/div) to join our team at Elinvar.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat will keep you challenged?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExtending our monitoring and alerting with a focus on business processes.\u003c/li\u003e\n\u003cli\u003eAssisting the integration of 3rd parties like custodians banks.\u003c/li\u003e\n\u003cli\u003eConstantly improving the security of the platform.\u003c/li\u003e\n\u003cli\u003eWorking on the Continuous Integration / Continuous Delivery process.\u003c/li\u003e\n\u003cli\u003eEnhancing our highly accessible platform while using the latest technologies like AWS, Kubernetes, Ansible, Docker, Prometheus, Couchbase and Kafka.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy Elinvar?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBased in Berlin, Elinvar is the comprehensive, digital and customized solution for wealth managers.\u003c/li\u003e\n\u003cli\u003eOur partners manage billions and expect excellence. We empower employees to reshape finance and look for talented and dedicated people.\u003c/li\u003e\n\u003cli\u003eOur co-founders share tremendous industry expertise and together with the team are dedicated to ensuring Elinvar's long-term success.\u003c/li\u003e\n\u003cli\u003eWe believe hard work and success deserve to be celebrated - both in and out of the office.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUniversity degree or an equivalent education.\u003c/li\u003e\n\u003cli\u003eExperience with configuration management tools like Ansible, Chef or Puppet.\u003c/li\u003e\n\u003cli\u003eExperience with Linux and scripting languages like BASH, Python.\u003c/li\u003e\n\u003cli\u003eKnowledge of Docker, Kubernetes, AWS is a plus.\u003c/li\u003e\n\u003cli\u003eFluent in English.\u003c/li\u003e\n\u003cli\u003eYou advocate DevOps philosophy and emphasize effective communication and collaboration between engineering, product, and operations.\u003c/li\u003e\n\u003cli\u003eYou never stop learning and are particularly passionate about technology.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAre you up for the challenge?\u003c/strong\u003e\nApply now via 'How to apply'.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/9edfb1c5f99f1383c1baf90797c6059fc6b2871e/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313333303835\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply now via the \u003ca href=\"https://ltpx.nl/DTO95wO\"\u003e\u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazEzIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99e5904faa08b526763a3da501ebda30ed42ee07/elinvar-logo-positive.png"},{"id":"fefb9fbe-b02b-455d-a1d7-ae0bbe936993","type":"Full Time","url":"https://jobs.github.com/positions/fefb9fbe-b02b-455d-a1d7-ae0bbe936993","created_at":"Fri Nov 08 10:56:57 UTC 2019","company":"Dental wings","company_url":"https://www.straumann.com/en/dental-professionals.html","location":"Berlin","title":"Senior Softwareentwickler (m/w/x) für CAD-Anwendungen (Java)","description":"\u003ch2\u003eSenior Softwareentwickler (m/w/x) für CAD-Anwendungen (Java)\u003c/h2\u003e\n\u003cp\u003eBerlin, Deutschland\nVollzeit\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUnternehmensbeschreibung\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDental Wings ist ein führender Anbieter digitaler Lösungen für die Dentalbranche. Zu unseren Haupttätigkeitsfeldern zählen dentale Scananwendungen, Software für Implantatplanung und geführte Chirurgie, Design von Zahnersatz, Lösungen zur Fertigungsanbindung sowie Tools für die Kommunikation der eingebundenen Experten und Fachleute. Unsere Produkte werden von führenden Dentalunternehmen weltweit in über 50 Ländern vertrieben. Der Hauptsitz des Unternehmens befindet sich in Montreal, Kanada. Außerhalb Kanadas unterhalten wir Geschäftsstellen in Berlin und Chemnitz (Deutschland) sowie Lyon (Frankreich) und in China. Dental Wings beschäftigt mehr als 150 Mitarbeiter.\u003c/p\u003e\n\u003cp\u003eZur Verstärkung unseres Teams am \u003cstrong\u003eStandort Berlin-Adlershof\u003c/strong\u003e suchen wir in unbefristeter Anstellung einen \u003cstrong\u003eSenior Softwareentwickler (m/w/x) für CAD-Anwendungen (JAVA).\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eStellenbeschreibung\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eGUI und Backend Development für die nächste Generation unserer Desktop CAD Produkte\u003c/li\u003e\n\u003cli\u003eDesign und Realisierung von User Workflows im Team in enger Zusammenarbeit mit dem Product Owner\u003c/li\u003e\n\u003cli\u003eVerbessern und Erweitern unseres Sourcecodes\u003c/li\u003e\n\u003cli\u003eUnterstützen des Übergangs von Legacy zu State-Of-The-Art\u003c/li\u003e\n\u003cli\u003eCode Reviewing - nicht nur auf Richtigkeit, sondern auch mit Blick auf Qualität und Langzeitwert\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifikationen\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMindestens 5 Jahre Berufserfahrung mit sehr guten Kenntnissen in Java, C# oder verwandten Sprachen\u003c/li\u003e\n\u003cli\u003eDen Anspruch soliden, wart- und testbaren, performanten Code zu schreiben\u003c/li\u003e\n\u003cli\u003eEine Passion für skalierbare Software Architektur und System Design\u003c/li\u003e\n\u003cli\u003eGute Kommunikationsfähigkeiten zur erfolgreichen, bereichsübergreifenden Zusammenarbeit\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eZusätzliche Informationen\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eSo arbeiten wir\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir nutzen SCRUM/Kanban mit täglichen Stand-ups an unserem SCRUM Board. Unser TechStack umfasst Eclipse, JUnit, Git, Gerrit, Sonar, Jenkins, Redmine und Slack. Zum GUI-Design nutzen wir JavaFX und OpenGL 4.5 zur 3D Visualisierung.\u003c/p\u003e\n\u003ch2\u003eDas bieten wir\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSpannende und innovative Projekte für renommierte Kunden aus der Medizintechnik\u003c/li\u003e\n\u003cli\u003eKurze Entscheidungswege und ein sympathisches, kompetentes Team aus EntwicklerInnen und ZahntechnikerInnen\u003c/li\u003e\n\u003cli\u003eModernes Büro mit familiärer Arbeitsatmosphäre\u003c/li\u003e\n\u003cli\u003eKein Dresscode\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten und der Möglichkeit von Homeoffice\u003c/li\u003e\n\u003cli\u003eIndividuelle Weiterbildungsmöglichkeiten\u003c/li\u003e\n\u003cli\u003eZahlreiche Benefits: Teamfrühstück, kostenfreie Getränke, frisches Obst, Firmenfitness, Inhouse Sprachkurs (Englisch), Bezuschussung Kinderbetreuung, Kantine und ÖPNV, Team Events\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eHaben wir Dein Interesse geweckt?\u003c/h2\u003e\n\u003cp\u003eDann freuen wir uns darauf, Dich kennen zu lernen. Bitte sende Deine vollständigen Bewerbungsunterlagen mit Gehaltsvorstellung und frühestem Eintrittstermin an \u003ca href=\"mailto:office.berlin@dental-wings.com\"\u003eoffice.berlin@dental-wings.com\u003c/a\u003e oder nutze gern unser Bewerbungsportal über \u003ca href=\"https://straumanngroup.redirect.your-jobresponse.com/senior_softwareentwickler_m_w_x_fuer_cad_anwendungen_java_berlin/258303/V819/anwenden\"\u003ediesen Link\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eBitte sende Deine vollständigen Bewerbungsunterlagen mit Gehaltsvorstellung und frühestem Eintrittstermin an \u003ca href=\"mailto:office.berlin@dental-wings.com\"\u003eoffice.berlin@dental-wings.com\u003c/a\u003e oder nutze gern unser Bewerbungsportal über \u003ca href=\"https://straumanngroup.redirect.your-jobresponse.com/senior_softwareentwickler_m_w_x_fuer_cad_anwendungen_java_berlin/258303/V819/anwenden\"\u003ediesen Link\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXgyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f5560fd03fe0eec32a54cd8f34e78ce720aade32/dental%20wings.jpg"},{"id":"4b740c73-3387-4925-bf26-2fdb7d1b1651","type":"Full Time","url":"https://jobs.github.com/positions/4b740c73-3387-4925-bf26-2fdb7d1b1651","created_at":"Mon Nov 04 11:47:22 UTC 2019","company":"Wooga gmbh","company_url":null,"location":"Berlin","title":"Frontend Engineer - Tools (React.js)","description":"\u003cp\u003eAs a Frontend Engineer (React.js) at Wooga you will work independently in a fairly small team that empowers our game teams by building all of the tools that they need. The products you build are used internally and empower other Woogas. With a generalist but broad technical knowledge ranging from javascript, react, typescript and electron (Atom Shell) to working with services like AWS, Google and GitHub, you help us provide the tools our game teams need to keep bringing delightful story-driven games to millions of players.\u003c/p\u003e\n\u003cp\u003eAs a member of our tools team you will work on projects including but not limited to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuilding internal dashboards aggregating live data from different sources (Google, GitHub, Artifactory, s3) by combining it with a state-of-art bootstrap react interface (no CSS!) to observe and interact with our custom build infrastructure for our own SDKs, games, and documentations.\u003c/li\u003e\n\u003cli\u003eWorking on internal tools based on typescript, electron, react and bootstrap to drive content for our story-driven games.\u003c/li\u003e\n\u003cli\u003eExtending our internal tools \u0026amp; pipelines to improve Marketing and User Acquisition KPIs.\u003c/li\u003e\n\u003cli\u003eProviding Git version-control support.\u003c/li\u003e\n\u003cli\u003eConfiguring and optimizing webpack builds.\u003c/li\u003e\n\u003cli\u003eDeveloping new APIs.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAbout you\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a few years of experience as a software engineer.\u003c/li\u003e\n\u003cli\u003eProficient user of typescript, javascript and react.\u003c/li\u003e\n\u003cli\u003eExperienced with writing tests using Mocha/Chai/Jest/ enzyme.\u003c/li\u003e\n\u003cli\u003eExperienced with API design.\u003c/li\u003e\n\u003cli\u003ePassionate about games.\u003c/li\u003e\n\u003cli\u003eBasic experience with the unity game engine, a plus.\u003c/li\u003e\n\u003cli\u003eYour written and spoken English is good - no German skills are required for the job, but we will help you learn if you want!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhy join us\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork in a small, autonomous team with a high degree of creative freedom.\u003c/li\u003e\n\u003cli\u003eCollaborative and open company culture dedicated to making world-class games.\u003c/li\u003e\n\u003cli\u003eTalented, inspiring colleagues from all over the world.\u003c/li\u003e\n\u003cli\u003eLocated in Europe’s most creative and vibrant city - we offer a generous and holistic relocation package if you are not already located in Berlin!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt Wooga we are committed to providing a friendly, safe and welcoming environment for everyone who works here or with us, regardless to gender, gender identity and expression, sexual orientation, disability, physical appearance, body size, race, age, religion (or lack thereof) and game preferences.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/6724abc01\"\u003ehttps://grnh.se/6724abc01\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDUyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--75ebf724390a17cc60197942e4ff01967ab525ff/wooga-logo.png"},{"id":"e96002f8-6daf-40ae-b253-393a9b2e971f","type":"Full Time","url":"https://jobs.github.com/positions/e96002f8-6daf-40ae-b253-393a9b2e971f","created_at":"Fri Nov 01 16:33:46 UTC 2019","company":"Trade Republic","company_url":"https://traderepublic.com","location":"Berlin, Germany","title":"iOS Engineer","description":"\u003ch2\u003eTrade Republic is Europe’s first commission-free mobile broker.\u003c/h2\u003e\n\u003cp\u003eWe offer easy, fast and convenient access to capital markets for everyone.\u003c/p\u003e\n\u003cp\u003eWith a German banking license and partners such as HSBC, Blackrock and solarisBank, we make stock trading dead simple and commission-free.\u003c/p\u003e\n\u003cp\u003eWe believe brokerage is poised for disruption driven by technology and automation. We have developed a proprietary banking platform operating for a fraction of the cost of traditional banks.\u003c/p\u003e\n\u003ch2\u003eWhat you'll be doing\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003ework with our 100% Swift codebase, following an MVVM pattern and developing features in an agile environment\u003c/li\u003e\n\u003cli\u003etake proactive responsibility for the long-term code quality and architecture, with a focus on writing clean and sustainable code\u003c/li\u003e\n\u003cli\u003ecollaborate with our existing team members with decisions around architecture and code structure-\u003c/li\u003e\n\u003cli\u003ehave a strong impact within our small mobile development team\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we look for\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eyou have a passion for a great UX and UI and you are keen to work closely with our designers to achieve this\u003c/li\u003e\n\u003cli\u003eyou are comfortable with Swift and the basics of reactive programming\u003c/li\u003e\n\u003cli\u003eyou enjoy working in an agile environment and have a self-driven personality with a “hands-on” approach\u003c/li\u003e\n\u003cli\u003eyou can identify and solve problems independently and efficiently\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eTech Stack\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e100% Swift 5.1\u003c/li\u003e\n\u003cli\u003eReactiveSwift/ReactiveCocoa\u003c/li\u003e\n\u003cli\u003eUIKit and programmatic Auto Layout\u003c/li\u003e\n\u003cli\u003eCoreGraphics and CoreAnimation\u003c/li\u003e\n\u003cli\u003eCarthage\u003c/li\u003e\n\u003cli\u003eWebSockets with a custom protocol, that bridges the reactive contract over the network\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:join@traderepublic.com\"\u003ejoin@traderepublic.com\u003c/a\u003e or apply directly at \u003ca href=\"https://traderepublic.com/careers/#iOS-engineer\"\u003ehttps://traderepublic.com/careers/#iOS-engineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEIyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0bc567b41639c57704f88d48634b1e521b07f29c/Clip%205.png"},{"id":"9142f014-8e6c-4696-830a-120860e3d093","type":"Full Time","url":"https://jobs.github.com/positions/9142f014-8e6c-4696-830a-120860e3d093","created_at":"Fri Nov 01 15:27:14 UTC 2019","company":"Project A Ventures","company_url":"https://www.project-a.com","location":"Berlin","title":"Senior Python Developer (m/f/d) - Logistics","description":"\u003cp\u003eProject A is the operational VC that provides its ventures with capital, an extensive network and exclusive access to a wide range of operational expertise. The Berlin-based investor makes use of the €260m in assets under its management to back early-stage companies in the digital technology space. With its unique organizational structure featuring 100 operational experts, Project A offers its portfolio companies hands-on support in the areas of Software Engineering, Digital Marketing, Design, Communications, Business Intelligence, Sales and Recruiting. The portfolio includes companies such as Artisense, Catawiki, Horizn Studios, KRY, LIQID, Spryker, uberall and WorldRemit. You can find more information at \u003ca href=\"http://www.project-a.com\"\u003ewww.project-a.com\u003c/a\u003e and on the blog insights.project-a.com.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking for:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA new team member for one of our portfolio companies.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat will keep you challenged?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBeing part of a smart, motivated and open-minded engineering team of our portfolio company that builds Europe’s largest digital FTL forwarder\u003c/li\u003e\n\u003cli\u003eCreating scalable services that help to manage thousands of trucks on the road and the business around it of our portfolio company\u003c/li\u003e\n\u003cli\u003eDriving the development by working closely together with other back- and front-end developers, UX/UI experts and product designers\u003c/li\u003e\n\u003cli\u003eBecoming a mentor for other team members and taking ownership of projects\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhich traits contribute to your success?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in building well designed and tested applications with a clean code\u003c/li\u003e\n\u003cli\u003eDeep understanding of Python and its ecosystem\u003c/li\u003e\n\u003cli\u003ePrefer working in teams, like to share your knowledge and being eager to learn\u003c/li\u003e\n\u003cli\u003eTo know how to write good tests or even practice TDD and know how to set up automated testing environments\u003c/li\u003e\n\u003cli\u003eBeing able to configure and run services on AWS and/or Google Cloud Platform\u003c/li\u003e\n\u003cli\u003eBeing passionate about code quality and being pragmatic in getting things done\u003c/li\u003e\n\u003cli\u003eTo have a drive for improving processes and thinking in long-term wins\u003c/li\u003e\n\u003cli\u003eFluency in English (in both written and verbal communication)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFluency in JavaScript or other programming languages\u003c/li\u003e\n\u003cli\u003eExperience with Django/DRF and PostgreSQL\u003c/li\u003e\n\u003cli\u003eExperience with Continuous Integration / Continuous Delivery\u003c/li\u003e\n\u003cli\u003eSkills in other items from our technology stack\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat to expect working with our portfolio company:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpect a competitive salary\u003c/li\u003e\n\u003cli\u003eProfit from self-organized, autonomous teams\u003c/li\u003e\n\u003cli\u003eLook forward to an atmosphere of continuous learning and improvement, including brown bag sessions and a Friday afternoon for projects of your choice\u003c/li\u003e\n\u003cli\u003eWork in a modern office in the heart of Berlin and be surrounded by encouraging founders and smart people you can learn a lot from\u003c/li\u003e\n\u003cli\u003eFeel supported by a quiet work environment with all the technical requirements you need\u003c/li\u003e\n\u003cli\u003eEnjoy regular team events to unwind and bond with your teammates\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDo you want to be part of the success story of our portfolio company?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking forward to your online application.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://project-a.join.com/jobs/450266-senior-python-developer-m-f-d-logistics?pid=be00edcfa2a2412692a3\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bpython%2Bdeveloper%2Bm%2Bf%2Bd%2B-%2Blogistics\"\u003ehttps://project-a.join.com/jobs/450266-senior-python-developer-m-f-d-logistics?pid=be00edcfa2a2412692a3\u0026amp;utm_source=stackoverflow\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bpython%2Bdeveloper%2Bm%2Bf%2Bd%2B-%2Blogistics\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2QyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ecead8a164d1e60aa7f72d64c22f8f0e4fabe465/Download.png"},{"id":"ac8d1c1f-46f3-414a-a392-9043f493fca3","type":"Full Time","url":"https://jobs.github.com/positions/ac8d1c1f-46f3-414a-a392-9043f493fca3","created_at":"Thu Jul 25 09:58:05 UTC 2019","company":"SoundCloud","company_url":"https://jobs.soundcloud.com/","location":"Berlin","title":"Senior Software Engineer - Search","description":"\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe are looking for an experienced software engineer to join our team in Berlin. As an engineer on search, you will contribute to build and maintain systems that empower our users to actively and easily discover SoundCloud’s huge and unique catalog. You will contribute to increase the search experience with respect to ranking, user assistance and user interface in order to enable listeners to find the most relevant and engaging content. We want people that come equipped with an open mind, creativity and a get-it-done attitude.\u003c/p\u003e\n\u003cp\u003eAs engineers at SoundCloud, our work often involves large-scale distributed systems, parallel computing, and data science. We actively improve our tools and processes to support collaboration and productivity. We cultivate an environment where we can all learn and grow. For more, read about \u003ca href=\"https://developers.soundcloud.com/blog/\"\u003eengineering at SoundCloud\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho you are\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience building and operating large scale distributed systems\u003c/li\u003e\n\u003cli\u003eExperience building large scale data processing pipelines\u003c/li\u003e\n\u003cli\u003eExperience or passionate about working in a hypothesis-driven development environment (e.g. a lot of experimentation)\u003c/li\u003e\n\u003cli\u003eProvide mentoring and coaching to more junior peers\u003c/li\u003e\n\u003cli\u003ePassionate about working with large amount of data to develop and evaluate data-driven products, striking a healthy balance between principled and pragmatic approaches to solve consumer use cases\u003c/li\u003e\n\u003cli\u003eGood communication skills with both technical and non-technical people (e.g. designers and product managers)\u003c/li\u003e\n\u003cli\u003eValues teamwork, shares gained knowledge with teammates and brainstorm new ideas\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDiversity at SoundCloud:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWe’re international! We operate in the US, Berlin and London and all of our communication is in English. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe have a flexible, friendly and inclusive office environment in Mitte \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOur environment is a learning one, with specific focus on development, including a professional development allowance and a possibility to use 20% of your time for a personal project.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou can contribute to our Engineering Blog. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNot located in Berlin? No worries, we offer extensive relocation support including allowances, one way flights, temporary accommodation and, by partnering with Expath, on the ground support on arrival.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eInterested in a gym membership, photography course or book? We have a Creativity and wellness benefit!\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWe offer free German courses in office at beginning, intermediate and advanced. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLunch twice a week, plus countless snacks and goodies! \u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply via this link: \u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4333241002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4333241002\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eor email your CV to \u003ca href=\"mailto:anya.voronova@soundcloud.com\"\u003eanya.voronova@soundcloud.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb050IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d6c90b7c200e89f017f728c67de94733594148d5/logo.png"},{"id":"5cb94c0b-da2a-4ffc-b211-1c66f47b4673","type":"Full Time","url":"https://jobs.github.com/positions/5cb94c0b-da2a-4ffc-b211-1c66f47b4673","created_at":"Thu Aug 22 13:19:46 UTC 2019","company":"SoundCloud","company_url":"http://www.soundcloud.com","location":"Berlin","title":"Backend Engineer","description":"\u003cp\u003eWhat's next in music happens on SoundCloud first. As the world’s largest open audio platform, SoundCloud is powered by a connected community of creators, listeners and curators who share, discover and influence what’s new, now and next in music and audio.\u003c/p\u003e\n\u003cp\u003eWe are looking for backend engineers to join our growing technology organisation!\u003c/p\u003e\n\u003cp\u003eAs backend engineers at SoundCloud, we build the infrastructure for products that music listeners and creators love. Our work often involves large-scale distributed systems, parallel computing, and data science. We actively improve our tools and processes to support collaboration and productivity. We cultivate an environment where we can all learn and grow.\u003c/p\u003e\n\u003cp\u003eYou have solid backend engineering skills and are motivated to work in these areas. You’re proactive and have experience collaborating closely with other teams. You enjoy crafting simple solutions to complex engineering problems and are able to communicate them to product managers. You’re an independent thinker, but thrive in a tight-knit team. You’re committed to the products you work on.\u003c/p\u003e\n\u003cp\u003eIf this describes you, we’d love to chat!   \u003c/p\u003e\n\u003cp\u003ePrior experience with microservices, JVM languages, automated testing, and continuous delivery are all highly valued. Scala is the main language we use, so you are either already proficient in it or excited to learn. Experience in technologies such as Hadoop, Spark, Kafka, and data processing pipelines is a plus.\u003c/p\u003e\n\u003cp\u003eWe're currently hiring for multiple teams with different missions, technologies and challenges; and we will discuss potential teams with you to figure out the best fit together.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDiversity at SoundCloud:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSoundCloud is for everyone. Diversity and open expression are fundamental to our organization; they help us build a social platform and global community where anyone can create, discover, and share sounds. We acknowledge the challenges in our industry, and strive to develop an inclusive culture where everyone can contribute.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply via this link: \u003ca href=\"https://jobs.soundcloud.com/job?gh_jid=4257398002\"\u003ehttps://jobs.soundcloud.com/job?gh_jid=4257398002\u003c/a\u003e or email your CV to \u003ca href=\"mailto:anya.voronova@soundcloud.com\"\u003eanya.voronova@soundcloud.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlp2IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--018fa4355470a24c7ffb1c9b4b7e9667ce22b49f/logo.png"},{"id":"cb1e9170-e832-11e8-8c0b-1d1828cf3aff","type":"Full Time","url":"https://jobs.github.com/positions/cb1e9170-e832-11e8-8c0b-1d1828cf3aff","created_at":"Wed Nov 14 17:30:09 UTC 2018","company":"Cobot","company_url":"http://cobot.me","location":"Berlin, Germany","title":"Backend Developer Ruby/Elixir","description":"\u003cp\u003eYou are looking to put your skills to use in a fast-moving product used by thousands of people every day? \u003cstrong\u003eYou care about maintainable, tested, well-documented code, consistency and technical excellence, while always putting the user’s needs first?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a developer focused on backend who is excited to work within an \u003cstrong\u003einternational and welcoming team\u003c/strong\u003e of backend developers, frontend developers, and support engineers to build and maintain a fast and robust codebase for Cobot.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCobot is a management platform for coworking spaces. Our app helps coworking spaces around the world to automate their operations so that they can focus on what matters most: building communities and welcoming workspaces.\u003c/strong\u003e Coworking spaces from New Delhi to San Francisco use us to manage their members, collect payments, book conference rooms, and more. Our customers range from small creative spaces with only a few members to huge business accelerators with thousands of people. We’re a bootstrapped company, operating since 2006 out of Berlin Kreuzberg. We’re a team of 15 people, meaning lots of opportunity for you to actively shape the product, and contribute to the success of the team in a very direct way.\u003c/p\u003e\n\u003cp\u003eOur technology stack is evolving all the time. Our backend is 90% Ruby/Rails, and we recently started to use Elixir. Our frontend is server generated HTML or Ember.JS. As databases, we use CouchDB, Postgres, DynamoDB. We deploy to AWS and Heroku.\u003c/p\u003e\n\u003cp\u003eOur team values working at a healthy pace and a normal working day over working long hours late into the night. We foster a culture of continuous improvement and learning. Making mistakes is part of what we do, and we make sure we have each other’s backs and learn from them.\u003c/p\u003e\n\u003cp\u003eWe value diversity in all aspects of our team. We value everyone’s questions, insights and feedback.\u003c/p\u003e\n\u003cp\u003eThis is a permanent, employed full-time position in Berlin.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://cobot.workable.com/j/CE9189A9C9\"\u003eRead on\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://cobot.workable.com/j/CE9189A9C9\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3RXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--596ac329ee8f03d221fe26add5a4ef67dd172bfa/b1d4b584-1e58-476c-85bd-4997962d599e"},{"id":"f62726c8-e1d6-11e8-96fe-e8de2ac8aeb6","type":"Full Time","url":"https://jobs.github.com/positions/f62726c8-e1d6-11e8-96fe-e8de2ac8aeb6","created_at":"Tue Nov 06 15:16:58 UTC 2018","company":"moovel Group GmbH","company_url":"https://www.moovel.com/de/DE","location":"Berlin","title":"Backend Engineer (f/m) Routing algorithms","description":"\u003cp\u003eRouting Squad seeks Backend Engineer (f/m)\u003c/p\u003e\n\u003cp\u003eHi,\nwe are Sudip, Ali, Paul and Aram from the routing squad. Our job is to create and enable routing solutions for our products and customers. We are looking for a backend-focused engineer to join our great squad. The main programming languages we use are Java 8 and Javascript ES6, but we believe that continuous learning is essential in an ever-changing and fast-paced technological environment.\u003c/p\u003e\n\u003cp\u003eFIRST A QUICK LOOK AT US\nOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of a large global corporation (Daimler AG), but at the heart of it we still are a startup. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 280 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.\u003c/p\u003e\n\u003cp\u003eHOW THE ROLE WORKS\nWe gather in small engineering teams organized around specific topics. The individual teams enjoy a high degree of autonomy, trust and responsibility. Innovation is key and very much encouraged and embraced in our teams. We value pragmatism, simplicity and collaboration. We live an open feedback and failure culture, because we know that both are necessary to find proper solutions. With us you will use state of the art technology and work self-determined in small, autonomous and agile teams. moovel tries to maintain a culture where engineers are provided with the tools of their choice and a friendly environment in which they can thrive.\u003c/p\u003e\n\u003cp\u003eSOME OF THE THINGS YOU WILL DO\nTeams at moovel choose the tools they regard as the best fit for their problems, at their discretion. Hence the technology stack is rather diverse. We employ a microservice backend architecture based on Docker and AWS. Cloud Services are leveraged wherever they help us to focus on our task. We practice Continuous Delivery and value DevOps culture (you build it, you run it).\u003c/p\u003e\n\u003cp\u003e• You design, implement, scale and monitor our routing backend which provides vehicle, public transport and intermodal directions for our mobility apps and platform\n• You implement routing algorithms in Java\n• You design and provide APIs around our routing services\n• You are involved in building infrastructure and tooling for importing data into our routing engine\n• You perform analysis to enable data driven decisions\n• You collaborate with cross-functional teams to define, design and ship new features\u003c/p\u003e\n\u003cp\u003eABOUT YOU\nYou should have experience in writing, maintaining \u0026amp; debugging Java code and should be concerned about clean, high quality and maintainable code. Graph theory and routing algorithms are well known to you. Also, vehicle routing problems (VRP) are no strangers to you or at least something you always wanted to learn more about and master. You have experience with and are open to get deep into OSM and GTFS data formats. Some exposure to service based architectures would be useful. Since we are working in a rapidly evolving environment you should be open to pick up new languages, tools and frameworks. Furthermore, we are working with Amazon Web Services so it would be good if you are familiar with cloud computing. As it is our corporate language, you should have good writing and verbal communication skills in English.\u003c/p\u003e\n\u003cp\u003eBENEFITS\u003c/p\u003e\n\u003cp\u003e• Choose your own hardware\n• Working with newest technologies \u0026amp; microservices\n• Company pension plan\n• Free breakfast, coffee \u0026amp; water\n• Mobility allowance\n• Be part of an interdisciplinary team of experts\n• Working on products with a high impact on society\n• International teams\n• Child care allowance\n• Flexible working hours\u003c/p\u003e\n\u003cp\u003eYou bring what we are looking for? Then we are more than happy to meet you soon! Just send us your application by clicking on the application form.\u003c/p\u003e\n\u003cp\u003eYours,\nSudip, Ali, Paul and Aram\u003c/p\u003e\n\u003cp\u003eClick here for the application form!\u003c/p\u003e\n\u003cp\u003eIf you have any questions or are in need for further information feel free to contact\u003c/p\u003e\n\u003cp\u003eJanosch Fingerhut\n+49 30 549073811\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eClick here for the application form!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTVXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--79b89947df8abf794c8777db4488c36a44da2105/022f6d60-e410-4564-a09b-5903a8d4271a"},{"id":"a412770a-e1d3-11e8-8b9f-cf224f66af92","type":"Full Time","url":"https://jobs.github.com/positions/a412770a-e1d3-11e8-8b9f-cf224f66af92","created_at":"Tue Nov 06 14:54:06 UTC 2018","company":"moovel Group GmbH","company_url":"https://www.moovel.com/de/DE","location":"Berlin","title":"Backend Engineer (f/m) Node.js","description":"\u003cp\u003eTransit Squad seeks Backend Engineer (f/m)\u003c/p\u003e\n\u003cp\u003eHi,\nwe’re the transit team at moovel. We build services, munch data and process real-time information in all things transit - and we’re looking for a backend engineer in the Berlin office to\njoin us in our effort to provide great public transit APIs as one of the pillars for moovel’s rapidly expanding mobility platform.\u003c/p\u003e\n\u003cp\u003eFIRST A QUICK LOOK AT US\nOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of a large global corporation (Daimler AG), but at the heart of it we still are a startup. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 250 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.\u003c/p\u003e\n\u003cp\u003eHOW THE ROLE WORKS\nWe gather in small engineering teams organized around specific topics. The individual teams enjoy a high degree of autonomy, trust and responsibility. Innovation is key and very much encouraged and embraced in our teams. We value pragmatism, simplicity and collaboration. We live an open feedback and failure culture, because we know that both are necessary to find proper solutions.\u003c/p\u003e\n\u003cp\u003eWith us you’ll use state of the art technology and work self-determined in small, autonomous and agile teams. moovel tries to maintain a culture where engineers are provided with the tools\nof their choice and a friendly environment in which they can thrive.\u003c/p\u003e\n\u003cp\u003eSOME OF THE THINGS YOU WILL DO\nTeams at moovel choose the tools they regard as best fit for their problems, at their discretion. Hence the technology stack is rather diverse. We employ a microservice backend architecture based on Docker and AWS. Cloud Services are leveraged wherever they help us to focus on our task. We practice Continuous Delivery and value DevOps culture (you build it, you run it). On the Frontend (IOS, Android and Web) we adopted and embraced Technologies like Swift, Kotlin, Rx or React.\u003c/p\u003e\n\u003cp\u003eBreaking down concrete tasks for this position is not that easy, but that's what makes it so exciting. Here are some things we want to entrust you right away:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou write, monitor, scale and architect microservices that comprise our transit backend\u003c/li\u003e\n\u003cli\u003eYou build infrastructure and tooling for importing data into our data stores\u003c/li\u003e\n\u003cli\u003eYou develop services using Node.js \u0026amp; Python\u003c/li\u003e\n\u003cli\u003eYou perform analysis to enable data driven decisions\u003c/li\u003e\n\u003cli\u003eYou write processing pipelines in Python\u003c/li\u003e\n\u003cli\u003eCollaborate with cross-functional teams to define, design and ship new features\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT YOU\nYou should have experience in writing, maintaining \u0026amp; debugging web services. You should be concerned about quality and maintainable code. Some exposure to functional programming, async concepts and micro services would be useful. While having working experience in the Node.js or Python web stack is a plus, it’s not a show-stopper in case you’re flexible and well versed in alternatives like Rails or Play. Since we are working in a rapidly evolving environment you should be open to pick up new languages, tools and frameworks. Furthermore, we are working with Amazon Web Services so it would be good if you are familiar with cloud technologies and methodologies like 12 Factor.\u003c/p\u003e\n\u003cp\u003eYou should be familiar with SQL. Additionally, it would be nice if you have experience with any of Elasticsearch, Lucene, Solr or similar search technologies. \u003c/p\u003e\n\u003cp\u003eAs it is our corporate language, you should have good written and verbal communication skills in English.\u003c/p\u003e\n\u003cp\u003eBENEFITS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eChoose your own hardware\u003c/li\u003e\n\u003cli\u003eWorking with newest technologies \u0026amp; microservices\u003c/li\u003e\n\u003cli\u003eCompany pension plan\u003c/li\u003e\n\u003cli\u003eFree breakfast, coffee \u0026amp; water\u003c/li\u003e\n\u003cli\u003eMobility allowance\u003c/li\u003e\n\u003cli\u003eBe part of an interdisciplinary team of experts\u003c/li\u003e\n\u003cli\u003eWorking on products with a high impact on society\u003c/li\u003e\n\u003cli\u003eInternational teams\u003c/li\u003e\n\u003cli\u003eChild care allowance\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSounds good?\nWe are more than happy to meet you soon! Just click the application form.\u003c/p\u003e\n\u003cp\u003eYour Transit Squad\nMagnus, Engineering Manager Search\u003c/p\u003e\n\u003cp\u003eClick here for the application!\u003c/p\u003e\n\u003cp\u003eIf you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut\n+49 30 549073811\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eClick here for the application!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3516d50eaf556f5817391b6fa7484e24bfe85f1/412aec9a-9ac1-46bd-b50f-c0bbafeb2d09"},{"id":"547b8a96-dc5c-11e8-97cc-5b8cae901903","type":"Full Time","url":"https://jobs.github.com/positions/547b8a96-dc5c-11e8-97cc-5b8cae901903","created_at":"Tue Oct 30 15:56:14 UTC 2018","company":"reBuy reCommerce GmbH","company_url":"http://rebuy.de","location":"Berlin, Germany","title":"Senior Mobile Developer | iOS","description":"\u003cp\u003e\u003cstrong\u003eCompany Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTECH @ reBuy reCommerce GmbH\u003c/p\u003e\n\u003cp\u003eWe are looking for the best people to be part of our adventure and create\nan enjoyable, focused and challenging environment which results in great\nculture, we live and enjoy everyday. Our small teams work closely together\nand can solve even the toughest business problems and find the best\npossible solution for our customers.\nAt reBuy TECH we believe that user experience depends on the software we\ndesign, which is why the code needs to excel. The whole architecture should\nbe fun to use, fast, rock solid and simply state of the art. Of course we\nalso know good code can only be created by great and happy people. In order\nto be good, you need to feel comfortable at work. We push hard to make work\nequal fun and challenging so you reach new heights.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Description\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMobile is a constantly growing part of our customer facing product and our\nambition is to provide mobile customers with the best possible experience.\nJoin our mobile apps team implementing new features, maintaining and\ntesting our iOS app throughout its lifecycle. Be part of a flourishing team\nthat is self-motivated and takes decision based on data, research and\ncustomer feedback. Contribute with your mobile know-how and bring our app\nto new quality heights. Play an active role on building an awesome\nreCommerce application that you are proud of.\nWant to build the greatest reCommerce iOS app currently available? We will\nbe happy to have you on board!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe expect that you have solid Swift experience, understand the ins and outs\nof iOS and what great features each new versions brought. You are used to\nutilize design patterns like MVVM to keep everything tidy and you are aware\nthat ReactiveX is not a chemistry formula. Writing tests is something you\nembrace and love doing, whilst moving fast forward. You feel comfortable\ncreating and maintaining your application APIs in PHP or bring the appetite\nto do so :)\u003c/p\u003e\n\u003cp\u003eCompiled:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have solid Swift experience\u003c/li\u003e\n\u003cli\u003eIn-depth knowledge of iOS 9 to 11 that enables you to create\ncompelling features for our customers\u003c/li\u003e\n\u003cli\u003eAwareness of design patterns (e.g. MVVM) and software principles (e.g.\nInversion of control)\u003c/li\u003e\n\u003cli\u003eReactiveX is a standard for you, RxSwift experience is a huge plus\u003c/li\u003e\n\u003cli\u003eFluent in writing unit tests\u003c/li\u003e\n\u003cli\u003eFamiliar with RESTful APIs to connect iOS applications to back-end\nservices\u003c/li\u003e\n\u003cli\u003eAndroid development experience is an advantage\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAdditional information\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are offering a unique job in an innovation-friendly company within an\ninspiring and flourishing environment. We always want you to be productive\nin your way. Before you join you can choose your state of the art hardware:\nAlthough our eco system is built around linux/mac, we don't care whether\nyou run Mac, Linux or Windows. Our atmosphere is open-minded: Something you\nwant to change or something to introduce? Let’s talk about it! The projects\nhave a broad scope for codecision-making. Our goals are ambitious and they\nwill lead us to exciting paths. So pick your favorite career, apply with a\npleasing CV and we will get back to you as quick as possible! For\ninternationals we provide relocation assistance.\u003c/p\u003e\n\u003cp\u003eGet to know the reBuy TECH team, our Tryday and our projects on: \u003cstrong\u003e\u003ca href=\"https://tech.rebuy.com/\"\u003eTECH @\nreBuy\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eHow to Apply: \u003ca href=\"http://smrtr.io/P6L8\"\u003ehttp://smrtr.io/P6L8\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e72a6990d74d0b29b7279f390a2630d1b6512a76/5b0dce1a-e6b1-4342-9670-167b76f12e90"},{"id":"861ca26c-dc4b-11e8-8a59-311f92072400","type":"Full Time","url":"https://jobs.github.com/positions/861ca26c-dc4b-11e8-8a59-311f92072400","created_at":"Tue Oct 30 13:58:53 UTC 2018","company":"Datawrapper","company_url":"http://www.datawrapper.de","location":"Berlin","title":"Client-facing Software Engineer","description":"\u003cp\u003eWe are \u003cstrong\u003e\u003ca href=\"https://www.datawrapper.de/\"\u003eDatawrapper\u003c/a\u003e\u003c/strong\u003e - a \u003cstrong\u003eweb-based charting tool\u003c/strong\u003e, and we want you to join us as a \u003cstrong\u003eclient-facing software engineer\u003c/strong\u003e in our office in Berlin, Prenzlauer Berg.\u003c/p\u003e\n\u003cp\u003eWhat's this exciting new position about? Well, although Datawrapper is used primarily by journalists, our customer base is growing and diversifying, and some of our users come with special requirements and challenges. We want to be able to accommodate these people as well. Enabling us to provide them with a flawless Datawrapper experience will be your job.\u003c/p\u003e\n\u003ch3\u003eThe kind of stuff you’ll be doing:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eDeveloping new visualization features\u003c/strong\u003e for specific customer groups. For example, an analyst at a financial institution might need different charting features than a data journalist at a local newspaper. We work with both, so that will be part of what you're responsible for.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eBuilding \u0026amp; maintaining integrations\u003c/strong\u003e with other software and tools. There are all kinds of other apps and tools that Datawrapper interacts with in the real world, like CMS’s and databases. Part of your job will be ensuring that those integrations are easy to build and run smoothly.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eExtending Datawrapper\u003c/strong\u003e to make sure it works well with large customer teams. When one person uses Datawrapper on their own, creating and organizing charts is pretty straight-forward. When there are hundreds of people creating charts in a large team, not so much! Ensuring that even the largest of our customers' teams don’t hit any walls when using Datawrapper will be part of this job.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWho we’re looking for:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eWe’re looking for a full stack web developer to join our Berlin development team, \u003cstrong\u003epreferrably full-time\u003c/strong\u003e, but open to flexible work time arrangements.\u003c/li\u003e\n\u003cli\u003eYou will have a full, regular employment contract. Due to the nature of this job, it will \u003cstrong\u003enot be possible to do this job entirely remote\u003c/strong\u003e. \u003cem\u003ePlease save yourself and us some time and only apply if you want to work with us in Berlin.\u003c/em\u003e\n\u003c/li\u003e\n\u003cli\u003eOn the technical side, most of the work we’re doing is front end development work in \u003cstrong\u003eJavaScript/ES6, D3.js, Bootstrap and \u003ca href=\"https://svelte.technology/\"\u003eSvelte\u003c/a\u003e\u003c/strong\u003e. There’s a PHP and MySQL backend as well, but that won’t be too much of your concern.\u003c/li\u003e\n\u003cli\u003eWe’re looking for somebody who has worked in web development before, but you don't need to have specific experience with our tooling or choice of frameworks. \u003cstrong\u003eWe’re happy to show you how our stack works.\u003c/strong\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWhat the \"client-facing\" part entails:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eA significant part of the job will involve \u003cstrong\u003einteracting with users and customers.\u003c/strong\u003e be it by phone, video call or email. We encourage everybody in our company to do this, but in this role it will be particularly prevalent\u003c/li\u003e\n\u003cli\u003eThat means we're looking for someone with \u003cstrong\u003egood communication, interpersonal and written skills\u003c/strong\u003e.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eStrong English skills\u003c/strong\u003e will also be necessary, as our users and customers sit all over the world.\u003c/li\u003e\n\u003cli\u003eNot a must-have, but a plus: German skills, interest in or experience with data visualization, experience working in a software company.\u003c/li\u003e\n\u003cli\u003eIf you have \u003cstrong\u003eany prior work you can show us\u003c/strong\u003e, open-source or not, please feel free to include it in your application. We'd love to take a look at it. Even if you don’t, please don’t feel discouraged to apply.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWhat we can offer:\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eA big desk in our office in Berlin Prenzlauer Berg\u003c/strong\u003e, where seven of us work (\u003ca href=\"https://blog.datawrapper.de/about-us/\"\u003eIvan, Lisa, Anna, Gregor, Elana, Hans \u0026amp; David\u003c/a\u003e). We have a massive library of data vis books, a coffee machine, tea en masse \u0026amp; interesting conversations about mapping, data vis and UX. Also, we honour lunch breaks.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eFlexible working hours.\u003c/strong\u003e We're looking for someone who wants to work for us \u003cstrong\u003eat least four days a week\u003c/strong\u003e. There's no 9-to-5 culture in our office, though. Some people come at 11 am, some leave at 4 pm, others like to work from home from time to time.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eA question-happy, communication-happy atmosphere.\u003c/strong\u003e We're all learning, and we want you to learn with us. If someone has an idea or a problem, we just talk. No meetings for most of us, a bit of Slack, lots of fun.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe don't care about CVs, just skills and attitude. If you don't find yourself 100% in the description, write Lisa an email anyway. Talk a bit about yourself and how your skills \u0026amp; experience could be a good fit for this job, and ask us aaaaall the questions you might have:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e→ \u003ca href=\"mailto:lisa@datawrapper.de\"\u003elisa@datawrapper.de\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're looking forward to hearing from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eWrite Lisa and tell us a bit about yourself and how your skills \u0026amp; experience could be a good fit for this job, and ask us all the questions you might have:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e→ \u003ca href=\"mailto:lisa@datawrapper.de\"\u003elisa@datawrapper.de\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe're looking forward to hearing from you!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdk5YIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cf96762c87fdda2397e9b85b068f9bc77e0f152a/2b5d809c-aa21-4327-b68d-bb898b05786b"}]